#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.www_staging_plancraftr_com: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket.staging_plancraftr_com: Refreshing state... [id=staging.plancraftr.com]
aws_security_group.staging_server_plancraftr_sg: Refreshing state... [id=sg-0aed0a29a24f497d1]
aws_instance.staging_server_plancraftr: Refreshing state... [id=i-044b9807af791e6fe]
aws_route53_record.staging_api_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_staging.api.plancraftr.com_A]
aws_s3_bucket_website_configuration.static_website_config_s3_staging: Refreshing state... [id=staging.plancraftr.com]
aws_s3_bucket_public_access_block.allow_public_access_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket_website_configuration.static_website_config_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.staging_plancraftr_com has changed
  ~ resource "aws_s3_bucket" "staging_plancraftr_com" {
        id                          = "staging.plancraftr.com"
      + website_domain              = "s3-website-ap-southeast-1.amazonaws.com"
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.www_staging_plancraftr_com has changed
  ~ resource "aws_s3_bucket" "www_staging_plancraftr_com" {
        id                          = "www.staging.plancraftr.com"
      + website_domain              = "s3-website-ap-southeast-1.amazonaws.com"
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.staging_plancraftr will be created
  + resource "aws_route53_record" "staging_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-ap-southeast-1.amazonaws.com"
          + zone_id                = "Z3O0J2DXBE1FTB"
        }
    }

  # aws_route53_record.www_staging_plancraftr will be created
  + resource "aws_route53_record" "www_staging_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.staging.plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-ap-southeast-1.amazonaws.com"
          + zone_id                = "Z3O0J2DXBE1FTB"
        }
    }

  # aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_staging will be created
  + resource "aws_s3_bucket_policy" "allow_anyone_get_objects_s3_www_staging" {
      + bucket = "www.staging.plancraftr.com"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "PlancraftrS3AccessPolicy"
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::www.staging.plancraftr.com/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_website_configuration.static_website_config_s3_staging will be updated in-place
  ~ resource "aws_s3_bucket_website_configuration" "static_website_config_s3_staging" {
        id               = "staging.plancraftr.com"
        # (3 unchanged attributes hidden)

      ~ redirect_all_requests_to {
          ~ protocol  = "https" -> "http"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hasangawr, Action: `pull_request`*